FROM python:3.13.1
# Стягиваем образ языка программирования с официального хаба.

ENV PYTHONUNBUFFERED=1
# Устанавливает переменную окружения, которая гарантирует, что вывод из python будет отправлен прямо в терминал без предварительной буферизации.

ENV PYTHONDONTWRITEBYTECODE=1
# PYTHONDONTWRITEBYTECODE - это переменная окружения в Python. 
# Установка ее в значение 1 говорит Python не создавать файлы байт-кода.
# Делается для ускорения сброки образа. Полезно, если код часто меняется.

WORKDIR /code
# Создание рабочей директории внутри контейнера.

RUN pip install --upgrade pip
# Обновляем пакетный менеджер pip.

COPY requirements.txt .
# Копируем requirements.txt в рабочую директорию для лучшего кэширования.

RUN pip install --no-cache-dir -r requirements.txt
# Устанавливаем зависимости без кэширования.

COPY entrypoint.sh .
# Копируем файл конфигурации проекта.

RUN chmod +x entrypoint.sh
# Делаем файл запускаемым

COPY . .
# Копируем проект в рабочую директорию контейнера.

ENTRYPOINT [ "./entrypoint.sh" ]
# Делаем точку запуска 